# -*- coding: utf-8 -*-

"""
FILE : warnWords 

DESCRIPTION:   
                                                                                       
FUNCTION LIST:  
  1. Words Warning .

REVISION:  

  
Ver  | yyyymmdd | Who    | Description of changes
1.00 | 20200519 | wxhao  | Create.

"""

import re

warnWds = {
    "可行的" : "可行的",
    "尽可能" : "尽可能" ,
    "[\u4e00-\u9fa5\s?]/[\u4e00-\u9fa5\s?]" : "/",
    "在[\u4e00-\u9fa5\s\w-]+之间" : "在...之间",
    "从[\u4e00-\u9fa5\s\w]+到[\u4e00-\u9fa5\s\w]+" : "从...到...",
    "依赖" : "依赖" ,
    "有效[的地]" : "有效的(地)" ,
    "迅速[的地]" : "迅速的(地)" ,
    "快[的地]" : "快的(地)" ,
    "快速[的地]" : "快速的(地)" ,
    "灵活[的地]" : "灵活的(地)" ,
    "通用[的地]" : "通用的(地)" ,
    "有提升" : "有提升" ,
    "更好" : "更好" ,
    "更快" : "更快" ,
    "更高级" : "更高级" ,
    "质量更高" : "质量更高" ,
    "包括" : "包括" ,
    "不限于" : "不限于",
    "等等" : "等等",
    "就像" : "就像",
    "比如" : "比如",
    "多数情况下" : "多数情况下",
    "通常" : "通常",
    "常常" : "常常",
    "几乎" : "几乎",
    "理想情况下" : "理想情况下",
    "可选的" : "可选的",
    "可能" : "可能",
    "合理" : "合理",
    "必要时" : "必要时",
    "恰当" : "恰当",
    "鲁棒性" : "鲁棒性",
    "强健" : "强健",
    "强壮" : "强壮",
    "健壮" : "健壮",
    "几个" : "几个",
    "一些" : "一些",
    "许多" : "许多",
    "很少" : "很少",
    "多个" : "多个",
    "大量" : "大量",
    "不应" : "不应",
    "不会" : "不会",
    "流行的" : "流行的",
    "充分的" : "充分的",
    "充分地" : "充分地",
    "支持[\u4e00-\u9fa5\s\w-]+功能" : "支持...功能",
    "具有[\u4e00-\u9fa5\s\w-]+功能" : "具有...功能",
    "友好[的地]" : "友好的",
    "简单[的地]" : "简单的",
    "容易[的地]" : "容易的",
    "TBD" : "TBD"
}


def warnWdsPars(line):
    for ele in warnWds:
        if re.search(ele, line):
            print("WARNNING: WORDS WARNNING.  %s"   %(line + " FOR " + warnWds[ele]))

